package enum

const (
	Title      = "Укажите номер задачи, которую вы хотите выполнить:"
	One        = "Напишите программу, которая запрашивает у пользователя ввод строки, а затем выводит число - количество символов в строке"
	Two        = "Напишите программу, которая подсчитывает количество гласных букв (а, е, ё, и, о, у, ы, э, ю, я) в введённой пользователем строке"
	Three      = "Создайте функцию capitalizeWords(s string) string, которая преобразует каждое слово в строке так, чтобы первая буква была заглавной, а остальные — строчными"
	Four       = "Напишите программу, которая запрашивает у пользователя ввод строки-формулы, а выводит сообщение о правильности написания круглых скобок"
	Five       = "Выход из приложения"
	Selected   = "Вы выбрали: "
	NotCorrect = " - не корректное число\n"
	Line       = "\n------------------------------------------------------------------------------------------------------------------------------------------------------------\n"
	Quit       = "quit"
	Exit       = "Выход"

	TitleOne  = "Выполняется задача №1"
	ReqOne    = "Введите строку: "
	ResOne    = "Количество символов в введенной строке:"
	FutterOne = "Задача №1 решена"
)
