package enum

const (
	Title        = "Укажите номер задачи, которую вы хотите выполнить:"
	One          = "Напишите программу, которая запрашивает у пользователя ввод строки, а затем выводит число - количество символов в строке"
	Two          = "Напишите программу, которая подсчитывает количество гласных букв (а, е, ё, и, о, у, ы, э, ю, я) в введённой пользователем строке"
	Three        = "Создайте функцию capitalizeWords(s string) string, которая преобразует каждое слово в строке так, чтобы первая буква была заглавной, а остальные — строчными"
	Four         = "Напишите программу, которая запрашивает у пользователя ввод строки-формулы, а выводит сообщение о правильности написания круглых скобок"
	Five         = "Выход из приложения"
	Selected     = "Вы выбрали: "
	NotCorrect   = " - не корректное число\n"
	Line         = "\n------------------------------------------------------------------------------------------------------------------------------------------------------------\n"
	Quit         = "quit"
	Exit         = "Выход"
	Vowels       = "аеёиоуыэюя"
	ReqText      = "Введите строку: "
	QuestionNext = "Нажмите Enter для повторного выполнения. Для возврата к выбору задач введите [Y]: "
	TitleTask    = "Выполняется задача"
	Futter       = "Задача решена"

	ResOne   = "Количество символов в введенной строке:"
	ResTwo   = "Количество гласных русского алфавита:"
	ResThree = "Преобразованная строка:"
	ResFour  = "Скобки расставлены"
	ReqFour  = "Введите формулу: "
)
