package main

/*
1xx информация
2xx успех
	200 - ОК
	201 Created
	202 Accepted
	204 Контента нет (В ответа на Delete )
3xx Перенаправление
	301 Meved Permanently  Ресурс переехал
	304 Not Modified - кэш актуален
4хх Ошибка клиента
	400 Bad request
	401 НЕ авторизован / не аутентифицирован
	404 Not Found
	405 Метод не разрешен
	422 Валидация не прошла
	429 Слишком много запросов
5хх Ошибка сервера
	500 Неожиданная ошибка
	502 Bad Gateway
	503 Сервис в настоящее время недоступен (перегружен)
*/

func main() {

}
